# Лабораторна робота 4
# Гасимова Аміна
# 5.Дано рядок. Виведіть третій символ цього рядка, перші п'ять символів цього рядка, всі символи у
# зворотному порядку.
line = str(input("Введіть рядок: "))
print(line[2])
print(line[0:5])
print(line[::-1])
