# Лабораторна робота 4
# Гасимова Аміна
# Дано рядок. Якщо в цьому рядку буква f зустрічається тільки один раз, виведіть її індекс. Якщо
# вона зустрічається два і більше разів, виведіть індекси її першої і останньої появи. Якщо буква f в
# цьому рядку не зустрічається, нічого не виводьте.
a = str(input("Введіть рядок: "))
if a.count('f') < 2:
    print(a.rfind('f'))
elif a.count('f') >= 2:
    print(a.find('f'), " ", a.rfind('f'))
