# Лабораторна робота 4
# Гасимова Аміна
# 20. Дано список чисел. Порахуйте, скільки в ньому пар елементів, рівних один одному. Вважається,
# що будь-які два елементи, рівні один одному, утворюють одну пару, яку необхідно порахувати.
k = 0
a = input("Введіть числа: ").split()
for e in range(len(a)):
    a[e] = int(a[e])
for i in range(len(a) - 1):
    for j in range(i + 1, len(a)):
        if a[i] == a[j]:
            k = k + 1
print(a)
print(k)
